다음 리스트에서 13으로 나눴을때 나머지가 1 인 원소만 출력하라

In [ ]:
a = [ 12342, 234345, 234435, 234356468, 34325, 234 ,266, 1456, 261, 2080274, 274, 93287, 287, 235365, 2342, 313, 300]

In [ ]:
result = filter ( lambda x : x%13==1, a)
print(list(result))

[261, 2080274, 274, 287, 313, 300]

다음 리스트의 원소 모두를 세제곱한 새로운 리스트를 만들어라
단, 2가지 방식으로 모두 만들어 볼 것!!!

1. def 함수를 통해 사용자 함수를 만들고 난 뒤 map 함수를 적용하는 방법
2. map 함수 속에 lambda 함수를 사용하여 한줄로 코딩하는 방법

In [ ]:
b = [ 12, 23, 35, 64, 43, 87 ,66, 56, 26, 74, 27, 93, 28, 53, 22, 31, 3]

In [ ]:
def three (x) :
    return x**3

print(list(map(three,b)))

[1728, 12167, 42875, 262144, 79507, 658503, 287496, 175616, 17576, 405224, 19683, 804357, 21952, 148877, 10648, 29791, 27]

In [ ]:
k=map(lambda i : i**3, b)
print(list(k))

[1728, 12167, 42875, 262144, 79507, 658503, 287496, 175616, 17576, 405224, 19683, 804357, 21952, 148877, 10648, 29791, 27]



다음 'study' data frame은 금요일 파이썬 스터디원들의 정보를 모아놓은 자료다.
major는 학회원들의 전공을, t_score와 i_score는 각각 시험 점수와 면접 접수를 정량화 해놓은 정보다.


kubig은 매 방학마다 리쿠르팅이 끝나면 'study' data frame 자료에 새회원들의 정보를 넣어 업데이트 한다.  


14기, 15기가 들어와서 study 자료가 업데이트되어도, 언제든지 study 데이터 프레임에서 전공이 통계학이고 시험 혹은 면접 점수가 90점 이상인 학생들만 뽑아서 보여주는 사용자 함수 new_function을 정의하라.

단, 학습 목적을 위해 사용자 함수 new_function은 study data frame의 t_score 혹은 i_score를 parameter로 입력했을때, 원하는 정보가 출력되도록 정의하라. 

만약 t_score 혹은 i_socre가 아닌 다른 변수를 입력하면 "you should input test score or interview score" 라고 출력하라

ex) new_funtion("t_score") 라고 명령하면 전공이 통계학이고 시험 점수가 90점 이상인 학회원들만 출력

ex) new_function("i_score") 라고 명령하면 전공이 통계학이고 면접 점수가 90점 이상인 학회원들만 출력

ex) new_function("addsgsf") 라고 명령하면 "you should input test score or interview score" 을 출력

In [ ]:
names = ['영신', '무성', '재성', '원석', '시전',"은지"]
major =  [ "statistics", "Sociology", "statistics" ,"Business" ,"Business","statistics" ]
th = [10,13,11,13,12,13]
test_score = [92, 89, 69, 83, 73,72]
interview_score = [ 97, 92, 87 , 83, 91, 73]

import pandas as pd
data = {'names':names, 'major':major,"th":th, 't_score':test_score, 'i_score':interview_score}
study = pd.DataFrame(data)
study.index = study.index+1
print(study)

  names       major  th  t_score  i_score
1    영신  statistics  10       92       97
2    무성   Sociology  13       89       92
3    재성  statistics  11       69       87
4    원석    Business  13       83       83
5    시전    Business  12       73       91
6    은지  statistics  13       72       73

In [ ]:
import numpy as np

def new_function (x):
    try:
       logic= study["major"]=="statistics"
       score=study[x]>=90
       result = np.logical_and(logic,score)      
       return study[result]
    
    except:
     print ( "you should input test score or interview score")


new_function("i_score")

  names       major  th  t_score  i_score
1    영신  statistics  10       92       97

14기 회원들이 들어와서 stydy data frame 자료가 업데이트 되었다.
new_function을 사용해서 회원들중 면접 점수가 90점 이상이고 전공이 통계학인 학회원들만 출력하라.

In [ ]:
names = ['영신', '무성', '재성', '원석', '시전',"은지","희원","유빈","서인","희진","지원","윤민","경민","세원"]
major =  [ "statistics", "Sociology", "statistics" ,"Business" ,"Business","statistics","Sociology","statistics","Business","statistics","statistics","Business","statistics","statistics"]
th = [10,13,11,13,12,13,14,14,14,14,14,14,14,14]
test_score = [92, 89, 69, 83, 73,72,87,93,97,86,90,92,87,95]
interview_score = [ 97, 92, 87 , 83, 91, 73,87,93,79,95,67,87,91,93]

import pandas as pd
data = {'names':names, 'major':major,"th":th, 't_score':test_score, 'i_score':interview_score}
study = pd.DataFrame(data)
study.index = study.index+1
print(study)

   names       major  th  t_score  i_score
1     영신  statistics  10       92       97
2     무성   Sociology  13       89       92
3     재성  statistics  11       69       87
4     원석    Business  13       83       83
5     시전    Business  12       73       91
6     은지  statistics  13       72       73
7     희원   Sociology  14       87       87
8     유빈  statistics  14       93       93
9     서인    Business  14       97       79
10    희진  statistics  14       86       95
11    지원  statistics  14       90       67
12    윤민    Business  14       92       87
13    경민  statistics  14       87       91
14    세원  statistics  14       95       93

In [ ]:
new_function("i_score")

   names       major  th  t_score  i_score
1     영신  statistics  10       92       97
8     유빈  statistics  14       93       93
10    희진  statistics  14       86       95
13    경민  statistics  14       87       91
14    세원  statistics  14       95       93

map과 lambda function을 활용해 Friends 리스트에 있는 값들의 첫글자를 대문자로 바꿔준 후,   
결과를 result에 저장하고, result를 list로 변환하여 result_list에 저장한 후, result_list를 출력하여 결과를 확인하세요.

In [54]:
Friends = ['ross', 'chandler', 'joey', 'monica', 'rachel', 'phoebe']
result = map(lambda x: x.capitalize(), Friends)
result_list = list(result)
print(result_list)

['Ross', 'Chandler', 'Joey', 'Monica', 'Rachel', 'Phoebe']

filter와 lambda function을 활용해 score 리스트에 있는 값들 중 50보다 큰 값을 추출한 후,  
결과를 high_score에 저장하고, high_score를 list로 변환하여 high_score_list에 저장한 후, high_score_list를 출력하여 결과를 확인하세요.

In [60]:
score = [100, 20, 32, 50, 64, 70]
high_score = filter(lambda x: x > 50, score)
high_score_list = list(high_score)
print(high_score_list)

[100, 64, 70]

동물병원A에서 반려견이 두 마리 등록돼 있는 가정 리스트를 정리하고자,  
두 마리의 반려견 이름을 각각 입력하면 dog1: word1 - dog2: word2 포맷의 리스트를 출력하는 함수 label을 만드려고 한다.  
함수의 결과값을 변수 'new_label'이라고 지정한다고 할 때,  
반려견 이름이 각각 happy와 coco인 집의 리스트를 출력하시오.

In [20]:
def label(word1, word2):
    label1 = "dog1: " + word1 + " - "
    label2 = "dog2: " + word2
    
    new_label = label1 + label2

    return new_label

pet = label('happy','coco')

print(pet)

dog1: happy - dog2: coco

모든 사람들이 일주일 동안 매일 자신이 정한 균등한 시간만큼 잔다고 가정할 때,  
하루에 x시간 자는 사람의 일주일 간 수면 시간에 " hours"를 붙이는 y를 구하는 함수 'seventimes'를 만들고,  
함수의 결과값을 변수 'sleeptime'으로 지정한다고 할 때,  
하루에 8시간 자는 A씨의 일주일 수면 시간을 출력하시오.

In [ ]:
def seventimes(x):
    y = str(7 * x) + " hours"
    return y

sleeptime = seventimes(8)

print(sleeptime)

## Review

### Q1. 아래 코드를 보고, for문에서의 연산 내용을 설명하시오.

In [1]:
def count_entries(df, col_name):
    """Return a dictionary with counts of occurrences as value for each key."""

    langs_count = {}
    col = df[col_name]

    for entry in col:
        if entry in langs_count.keys():
            langs_count[entry] +=1
        else:
            langs_count[entry] = 1

    return(langs_count)

cf. df의 column들은 다음과 같이 구성되어있다.

Index(['contributors', 'coordinates', 'created_at', 'entities', 'extended_entities', 'favorite_count', 'favorited', 'filter_level', 'geo', 'id', 'id_str', 'in_reply_to_screen_name',
       'in_reply_to_status_id', 'in_reply_to_status_id_str', 'in_reply_to_user_id', 'in_reply_to_user_id_str', 'is_quote_status', 'lang', 'place', 'possibly_sensitive', 'quoted_status',
       'quoted_status_id', 'quoted_status_id_str', 'retweet_count', 'retweeted', 'retweeted_status', 'source', 'text', 'timestamp_ms', 'truncated', 'user'],
      dtype='object')

## Applied

### 어느 프로그래밍 언어를 배우던 구구단 함수 만들기는 거의 빠지지 않을 것입니다.
### 우리도 만들어봅시다, 구구단 함수. 단, 응용을 좀 해서요.

### 지시사항
 - 함수 명은 multi_table로 지정합니다.
 - 원하는 것은, 함수에 i,j,k 세개의 변수를 넣었을 때, i단에 대하여 j곱부터 k곱까지의 결과를 출력하는 함수를 만드는 것입니다.
 (예: multi_table(2,3,5)의 결과값은 2*3=6부터 2*5=10까지 총 세줄에 걸쳐 나와야 합니다.)
 - Output은 2 * 3 = 6 과 같은 형태로 출력되게 해주세요.
 - range 함수와 for문을 활용하면 3줄로 함수를 만들 수 있습니다.

In [54]:
#정답

def multi_table(i,j,k):
    for n in range(j,k+1):
        print(i,'*',n,'=',i*n)

In [57]:
#예시

multi_table(2,3,5)

2 * 3 = 6
2 * 4 = 8
2 * 5 = 10